# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this US_Baby_Names_right.csv

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names = pd.read_csv('data/US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
baby_names = baby_names.drop(baby_names.columns[[0, 1]], axis=1)

### Step 6. Is there more male or female names in the dataset?

In [5]:
baby_names.groupby('Gender')['Count'].sum()

Gender
F    16380293
M    19041199
Name: Count, dtype: int64

In [ ]:
There are more males

### Step 7. Group the dataset by name and assign to names

In [6]:
names = pd.DataFrame(baby_names.groupby('Name')['Count'].agg('sum'))

### Step 8. How many different names exist in the dataset?

In [7]:
names.size

17632

### Step 9. What is the name with most occurrences?

In [8]:
names.sort_values('Count',ascending=False).head(1)

        Count
Name
Jacob  242874

In [ ]:
It is Jacob, 242874 times

### Step 10. How many different names have the least occurrences?

In [9]:
names.loc[names['Count'] == names.min().Count]

            Count
Name
Aadarsh         5
Aadin           5
Aaima           5
Aalaya          5
Aaminah         5
Aaniya          5
Aaria           5
Aarika          5
Aarvi           5
Aaryav          5
Aasha           5
Aashritha       5
Aasia           5
Aayansh         5
Abbiegail       5
Abdifatah       5
Abdihafid       5
Abdiqani        5
Abdirahim       5
Abdishakur      5
Abdo            5
Abeer           5
Abelino         5
Abenezer        5
Abhijot         5
Abhimanyu       5
Abigaile        5
Aceyn           5
Ackley          5
Adalay          5
...           ...
Zeenat          5
Zeeshan         5
Zein            5
Zeinabou        5
Zekhi           5
Zeltzin         5
Zemirah         5
Zenab           5
Ziare           5
Zienna          5
Zimere          5
Zinachidi       5
Zita            5
Ziv             5
Ziyan           5
Ziza            5
Zlatan          5
Zniyah          5
Zohaib          5
Zohal           5
Zoria           5
Zuleidy         5
Zunaira         5
Zyairah         5
Zyeria          5
Zyien           5
Zyire           5
Zykeriah        5
Zykierra        5
Zymari          5

[2578 rows x 1 columns]

In [ ]:
There are 2578 names with 5 occurrences

### Step 11. What is the median name occurrence?

In [10]:
names.median()

Count    49.0
dtype: float64

### Step 12. What is the standard deviation of names?

In [11]:
names.std()

Count    11006.069468
dtype: float64

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [12]:
names.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000